{"class_name": "Model", "config": {"name": "model_12", "layers": [{"name": "unigram", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null], "dtype": "int32", "sparse": false, "name": "unigram"}, "inbound_nodes": []}, {"name": "bigram", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null], "dtype": "int32", "sparse": false, "name": "bigram"}, "inbound_nodes": []}, {"name": "embedding_unigram", "class_name": "Embedding", "config": {"name": "embedding_unigram", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 5004, "output_dim": 300, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null, "dtype": "float32"}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": true, "input_length": null}, "inbound_nodes": [[["unigram", 0, 0, {}]]]}, {"name": "embedding_bigram", "class_name": "Embedding", "config": {"name": "embedding_bigram", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 40002, "output_dim": 300, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null, "dtype": "float32"}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": true, "input_length": null}, "inbound_nodes": [[["bigram", 0, 0, {}]]]}, {"name": "concatenate_embedding", "class_name": "Concatenate", "config": {"name": "concatenate_embedding", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["embedding_unigram", 0, 0, {}], ["embedding_bigram", 0, 0, {}]]]}, {"name": "Bidirectional_RNN", "class_name": "Bidirectional", "config": {"name": "Bidirectional_RNN", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "Bidirectional_LSTM", "trainable": true, "dtype": null, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 256, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.3, "recurrent_dropout": 0.25, "implementation": 1}}, "merge_mode": "concat"}, "inbound_nodes": [[["concatenate_embedding", 0, 0, {}]]]}, {"name": "Output", "class_name": "TimeDistributed", "config": {"name": "Output", "trainable": true, "dtype": "float32", "layer": {"class_name": "Dense", "config": {"name": "dense_12", "trainable": true, "dtype": null, "units": 4, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["Bidirectional_RNN", 0, 0, {}]]]}], "input_layers": [["unigram", 0, 0], ["bigram", 0, 0]], "output_layers": [["Output", 0, 0]]}, "keras_version": "2.1.6-tf", "backend": "tensorflow"}